
####################################Location Crackformer#################################
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.50, 1024]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, CrackBottleNeck, [128, 3, 2, 1, 1, 1]] #1
  - [-1, 1, CrackBottleNeck, [256, 3, 2, 2, 1, 1]] #2
  - [-1, 1, CrackBottleNeck, [512, 3, 2, 1, 1, 1]] #3
  - [-1, 1, RepCrackFormer, [1024, 's']] #4 #You can use 'x' to select a large model
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #5
  - [[-1, 3], 1, Concat, [1]]  #6 cat backbone P4
  - [-1, 3, C2f, [512]]  # 7

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #8
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3 #9

  ##########CrackLocationBgein##########
  - [-1, 3, Location, [256]]  # 10 (P3/8-small)
  - [-1, 1, CrackConv, [256, 3, 2]] #11

  - [[-1, 7], 1, Concat, [1]]  # cat head P4 #12

  - [-1, 3, Location, [512]]  # 13 (P4/16-medium)
  - [-1, 1, CrackConv, [512, 3, 2]] #14
  ###########CrackLocationEnd###########

  - [[-1, 4], 1, Concat, [1]]  # cat head P15
  - [-1, 3, C2f, [1024]]  # 16 (P5/32-large)

  - [[10, 13, 16], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)