
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  n: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, CrackLayer, [512]]
  - [-1, 1, RepCrackFormer, [1024, 's']] #7 #You can use 'x' to select a large model
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 10

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3

  ##########CrackLocationBgein##########
  - [-1, 3, Location, [256]]  # 13 (P3/8-small)
  - [-1, 1, CrackConv, [256, 3, 2]]

  - [[-1, 10], 1, Concat, [1]]  # cat head P4

  - [-1, 3, Location, [512]]  # 16 (P4/16-medium)
  - [-1, 1, CrackConv, [512, 3, 2]]
  ###########CrackLocationEnd###########

  - [[-1, 7], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 19 (P5/32-large)

  - [[13, 16, 19], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)